[
  {
    "id": 0,
    "commonName": "American alligators",
    "scientificName": "Alligator mississippiensis",
    "type": "Reptiles",
    "diet": "Carnivore",
    "groupName": "Congregation",
    "lifeSpan": "35 to 50 years",
    "description": "American alligators once faced extinction. The United States Fish and Wildlife Service placed them on the endangered species list in 1967. Fortunately, the legal protection worked. Just 20 years later, American alligators were taken off the list."
  },
  {
    "id": 1,
    "commonName": "Meller's Chameleon",
    "scientificName": "Trioceros melleri",
    "type": "Reptiles",
    "diet": "Carnivore",
    "groupName": "",
    "lifeSpan": "12 years",
    "description": "A chameleon sits motionlessly on a tree branch. Suddenly its sticky, two-foot-long tongue snaps out at 13 miles an hour, wrapping around a cricket and whipping the yummy snack back into the reptile’s mouth. Now that’s fast food dining! And the chameleon’s swift eating style is just one of its many features that’ll leave you tongue-tied."
  },
  {
    "id": 2,
    "commonName": "Arctic foxes",
    "scientificName": "Vulpes lagopus",
    "type": "Mammals",
    "diet": "Omnivore",
    "groupName": "Skulk, leash",
    "lifeSpan": "3 to 6 years",
    "description": "Not far from the North Pole, the world is frozen for thousands of miles. Suddenly a snowy mound wiggles and reveals two dark eyes. The lump is transformed into the furry white body of a lone arctic fox. The canine casually shakes the blanket of snow off her thick coat—the key to her survival. But warm fur alone might not keep this fox alive during the polar winter, when temperatures rarely get above zero degrees Fahrenheit. Until spring arrives, this arctic fox will rely on some freeze-defying strategies, making it a champion of the cold."
  },
  {
    "id": 3,
    "commonName": "Amur leopards",
    "scientificName": "Panthera pardus orientalis",
    "type": "Mammals",
    "diet": "Carnivore",
    "groupName": "",
    "lifeSpan": "10 to 15 years",
    "description": "Slowly stalking down the snowy hillside, the Amur leopard watches its prey through the trees. In the clearing below, a sika deer munches on tree bark, one of its few remaining food sources during the cold Russian winter. The leopard crouches, its body so low to the ground that its belly fur brushes the snow. Suddenly it bounds and springs forward, tackling the deer from 10 feet away. It’s dinnertime."
  },
  {
    "id": 4,
    "commonName": "African elephants",
    "scientificName": "Loxodonta",
    "type": "Mammals",
    "diet": "Herbivore",
    "groupName": "Herd",
    "lifeSpan": "Up to 70 years",
    "description": "An adult African elephant's trunk is about seven feet (two meters) long! It's actually an elongated nose and upper lip. Like most noses, trunks are for smelling."
  },
  {
    "id": 5,
    "commonName": "American bison",
    "scientificName": "Bison bison",
    "type": "Mammals",
    "diet": "Herbivore",
    "groupName": "Herd",
    "lifeSpan": "12 to 20 years",
    "description": "Bison are the iconic image of the Great Plains and the Old West. They are massive, shaggy beasts and the heaviest land animals in North America."
  },
  {
    "id": 6,
    "commonName": "Aardvarks",
    "scientificName": "Orycteropus afer",
    "type": "Mammals",
    "diet": "Insectivore",
    "groupName": "",
    "lifeSpan": "23 years",
    "description": "The aardvark gets its name from a South African word meaning “earth pig.” Although the aardvark looks like a pig, especially with its body and snout, aardvarks actually share common ancestors with elephants and golden moles. Aardvarks live throughout much of sub-Saharan Africa."
  },
  {
    "id": 7,
    "commonName": "Adélie penguins",
    "scientificName": "Pygoscelis adeliae",
    "type": "Birds",
    "diet": "Carnivore",
    "groupName": "Colony",
    "lifeSpan": "11 to 20 years",
    "description": "Adélie penguins breed and raise their young on the continent of Antarctica. In September and October—springtime in that part of the world—thousands of Adélies gather on the rocky Antarctic shoreline. The huge gatherings are called colonies."
  },
  {
    "id": 8,
    "commonName": "Bald eagle",
    "scientificName": "Haliaeetus leucocephalus",
    "type": "Birds",
    "diet": "Carnivore",
    "groupName": "Convocation",
    "lifeSpan": "20 to 30 years",
    "description": "A bald eagle's white head may make it look bald. But actually the name comes from an old English word, 'balde,' meaning white. These graceful birds have been the national symbol of the United States since 1782."
  },
  {
    "id": 9,
    "commonName": "American crows",
    "scientificName": "Corvus brachyrhynchos",
    "type": "Birds",
    "diet": "",
    "groupName": "",
    "lifeSpan": "",
    "description": "If you live in the contiguous United States, you’ve almost certainly seen (or heard!) an American crow."
  },
  {
    "id": 10,
    "commonName": "Blue Marlin",
    "scientificName": "Makaira nigricans",
    "type": "Fish",
    "diet": "Carnivore",
    "groupName": "School",
    "lifeSpan": "27 years (females); 18 years (males)",
    "description": "Blue marlins are among the largest, fastest, and most recognizable fish in the world. Their cobalt blue and silvery white bodies and spear-shaped upper jaws make this big fish stand out in a big ocean."
  },
  {
    "id": 11,
    "commonName": "Parrotfish",
    "scientificName": "Scaridae",
    "type": "Fish",
    "diet": "Omnivore",
    "groupName": "School",
    "lifeSpan": "Up to 7 years",
    "description": "A bright flash of blue, pink, and green glides through the water. A three-feet-long parrotfish swims through a Caribbean coral reef searching for food. With its super-strong teeth, the fish tears off a hunk of coral, biting down to get at the nutrient-rich algae inside. Once the fish is full, it continues swimming through the reef, leaving a puff of fine white sand trailing behind it."
  }
]
